# Prediction benchmark: mean calculation (mean num_orders per center/meal combination)

In [11]:
import pandas as pd

In [12]:
train = pd.read_csv('../data/train/train.csv')
test = pd.read_csv('../data/test.csv')
sample_submission = pd.read_csv('../data/sample_submission.csv')

In [18]:
mean_weekly_orders = train.groupby(['center_id','meal_id'],as_index=False)['num_orders'].mean()
mean_weekly_orders.tail()

      center_id  meal_id  num_orders
3592        186     2707  206.924138
3593        186     2760   60.375887
3594        186     2826  271.391608
3595        186     2867   37.717172
3596        186     2956   32.400000

In [17]:
test_merged = pd.merge(test,mean_weekly_orders,on=['center_id','meal_id'],how='left')
test_merged.tail()

,id,week,center_id,meal_id,checkout_price,base_price,emailer_for_promotion,homepage_featured,num_orders
32568,1250239,155,61,1543,482.09,484.09,0,0,67.623188
32569,1039516,155,61,2304,483.09,483.09,0,0,41.616667
32570,1158107,155,61,2664,322.07,323.07,0,0,345.077519
32571,1444235,155,61,2569,322.07,323.07,0,0,444.362205
32572,1291286,155,61,2490,276.45,276.45,0,0,270.283333

In [19]:
test_merged['num_orders'].isna().sum()

13

13 (center, meal) combinations are not available in the train set. I tried two imputation strategies (zero and mean) and found out that the latter gives a better score.

In [23]:
sub_1 = test_merged[['id','num_orders']]
sub_1['num_orders'].fillna(sub_0['num_orders'].mean(),inplace=True)

In [24]:
sub_1

            id  num_orders
0      1028232  230.324138
1      1127204  246.972414
2      1212707  190.555556
3      1082698   55.589147
4      1400926   44.548387
...        ...         ...
32568  1250239   67.623188
32569  1039516   41.616667
32570  1158107  345.077519
32571  1444235  444.362205
32572  1291286  270.283333

[32573 rows x 2 columns]

# submission score: 70.29